app/controllers/posts_controller.rb

  def update
    if @post.update(content: params[:post][:content], title: params[:post][:title])
---
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "Title 2"], ["content", "This is a content 2."], ["updated_at", "2019-08-19 16:42:09.766993"], ["id", 7]]

  def find_post
    @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]